antfu.smart-clicks
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
editorconfig.editorconfig
esbenp.prettier-vscode
ms-azuretools.vscode-containers
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
redhat.java
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vivaxy.vscode-conventional-commits
vmware.vscode-spring-boot
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-test
vscjava.vscode-maven
vscjava.vscode-spring-boot-dashboard
vscjava.vscode-spring-initializr
vue.volar
yzhang.markdown-all-in-one
