antfu.smart-clicks
charliermarsh.ruff
davidanson.vscode-markdownlint
editorconfig.editorconfig
esbenp.prettier-vscode
ms-azuretools.vscode-containers
ms-ceintl.vscode-language-pack-zh-hans
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
streetsidesoftware.code-spell-checker
usernamehw.errorlens
vivaxy.vscode-conventional-commits
yzhang.markdown-all-in-one
